import { ITableData } from "#ui/price-table/price-table.tsx";
import { serviceNames } from "#utils/auxuliary/services-items-list.ts";

interface IPrices {
  readonly [key: string]: ITableData;
}

export const PRICES: IPrices = {
  vinyl: {
    headCols: ["Класс авто", "Работа", "Плёнка"],
    data: [
      [{ value: "Базовый / Стандартный кузов" }, { value: "110 000" }, { value: "от 35 000" }],
      [
        { value: "Крупный / сложный / с большим количеством накладок кузов" },
        { value: "165 000" },
        { value: "от 42 000" },
      ],
    ],
    headTitle: "ПОЛНАЯ ОКЛЕЙКА",
  },
  sewing: {
    headCols: [
      "Элемент",
      "Снятие / Установка",
      "Экокожа",
      "Натуральная кожа текстурная",
      "Натуральная кожа гладкая (Nappa)",
      "Ткань",
      "Алькантара",
    ],
    data: [
      [
        { value: "Руль трёхспицевый" },
        { value: "3 000" },
        { value: "5 500" },
        { value: "8 500" },
        { value: "10 500" },
        { value: " " },
        { value: "13 500" },
      ],
      [
        { value: "Руль четырёхспицевый" },
        { value: "3 000" },
        { value: "5 500" },
        { value: "10 000" },
        { value: "12 000" },
        { value: " " },
        { value: "15 000" },
      ],
      [
        { value: "Руль с изменённой анатомией" },
        { value: "3 000" },
        { value: "10 500" },
        { value: "15 000" },
        { value: "18 000" },
        { value: " " },
        { value: "22 500" },
      ],
      [
        { value: "Наличие обогрева" },
        { value: " " },
        { value: " " },
        { value: "+2 000" },
        { value: " " },
        { value: " " },
        { value: " " },
      ],
      [
        { value: "Замена подложки или утолщение" },
        { value: " " },
        { value: " " },
        { value: "+2 000" },
        { value: " " },
        { value: " " },
        { value: " " },
      ],
      [
        { value: "Лекало под экокожу/кожу (если руль без штатной оплётки) " },
        { value: " " },
        { value: " " },
        { value: "+2 000 / +4 000" },
        { value: " " },
        { value: " " },
        { value: " " },
      ],

      [
        { value: "'Нулевая отметка'" },
        { value: " " },
        { value: " " },
        { value: "+2 000" },
        { value: " " },
        { value: " " },
        { value: " " },
      ],

      [
        { value: "Ремонт 'резиновой' основы руля" },
        { value: " " },
        { value: " " },
        { value: "+2 000 - 6 000" },
        { value: " " },
        { value: " " },
        { value: " " },
      ],

      [
        { value: "Сиденья (перед+зад)" },
        { value: "8 000" },
        { value: "120 000" },
        { value: "200 000" },
        { value: "240 000" },
        { value: " " },
        { value: " " },
      ],

      [
        { value: "Потолок + стойки + козырьки (базовый класс)" },
        { value: "10 000" },
        { value: " " },
        { value: " " },
        { value: " " },
        { value: "50 000" },
        { value: "80 000" },
      ],

      [
        { value: "Потолок + стойки + козырьки (крупный/сложный класс)" },
        { value: "15 000" },
        { value: " " },
        { value: " " },
        { value: " " },
        { value: "100 000" },
        { value: "170 000" },
      ],
    ],

    // headTitle: "ПОШИВ САЛОНОВ",
  },

  tinting: {
    headCols: ["Объекты", "Тонировочная плёнка", "Атермальная плёнка", "Укрепляющая плёнка", "Полиуретан"],
    data: [
      [{ value: "3 стекла" }, { value: "12 000" }, { value: "16 500" }, { value: "24 000" }, { value: "-" }],
      [{ value: "3 стекла + форточки" }, { value: "15 000" }, { value: "19 500" }, { value: "30 000" }, { value: "-" }],
      [{ value: "5 стёкол + форточки" }, { value: "18 000" }, { value: "22 500" }, { value: "36 000" }, { value: "-" }],
      [{ value: "2 боковых стекла" }, { value: "12 000" }, { value: "16 500" }, { value: "24 000" }, { value: "-" }],
      [{ value: "2 форточки" }, { value: "2 000" }, { value: "2 000" }, { value: "2 000" }, { value: "-" }],
      [
        { value: "Заднее стекло (большое)" },
        { value: "7 500" },
        { value: "10 000" },
        { value: "15 000" },
        { value: "-" },
      ],
      [{ value: "Лобовое стекло" }, { value: "10 500" }, { value: "13 500" }, { value: "21 000" }, { value: "-" }],
      [{ value: "Фары" }, { value: "-" }, { value: "-" }, { value: "-" }, { value: "9 000" }],
      [{ value: "ПТФ" }, { value: "-" }, { value: "-" }, { value: "-" }, { value: "3 000" }],
      [{ value: "Фонари" }, { value: "-" }, { value: "-" }, { value: "-" }, { value: "9 000" }],
    ],
    // headTitle: "ТОНИРОВАНИЕ СТЕКОЛ И ОПТИКИ",
  },

  light: {
    headCols: ["Вид работы", "Стоимость"],
    data: [
      [{ value: "Снятие/установка фар/ПТФ" }, { value: "3 000" }],
      [{ value: "Разбор/сбор фар на горячем герметике, ПТФ" }, { value: "10 000" }],
      [{ value: "Разбор/сбор фар на холодном герметике" }, { value: "12 000–15 000" }],
      [{ value: "Покраска масок и прочих внутренних элементов" }, { value: "8 000 – 22 000" }],
      [{ value: "Установка би-ксеноновых/диодных линз в фары" }, { value: "6 000 – 8 000" }],
      [
        { value: "Установка би-ксеноновых/диодных линз в фары с адаптивным (поворотным) механизмом" },
        { value: "10 000 – 12 000" },
      ],
      [{ value: "Установка и подключение ДХО внешних" }, { value: "6000" }],
      [
        {
          value:
            "Установка и подключение дополнительных внутренних модулей (ДХО, ангельские глазки, подсветка линз и т.д.)",
        },
        { value: "3 000" },
      ],

      [
        {
          value:
            "Установка контурной подсветки салона Ambient (многоцветная, многорежимная, с управлением по Bluetooth), включая компоненты - 10 / 18 / 22 точки",
        },
        { value: "25 000 / 35 000 / 40 000" },
      ],
    ],
  },

  soundproofing: {
    headCols: ["Деталь", "Стандарт", "Оптимал", "Премиум"],
    data: [
      [
        { value: "Крыша" },
        { value: "Practic 2.1 + П4В Space 2.0 + Комфорт 6 / Absorber A15", colSpan: 2, rowSpan: 4 },
        { value: "Jack + Комфорт 3 + Герметон 7" },
      ],
      [{ value: "Двери" }, { value: "Jack + Jack/Bass + Герметон А15" }],
      [{ value: "Пол салона и багажника" }, { value: "Black Jack + Prizma / Paradox / Membrane" }],
      [{ value: "Крышка багажника" }, { value: "Jack + Герметон А15" }],
    ],
  },

  sound: {
    headCols: ["Вид работ", "Стоимость"],
    data: [
      [
        {
          value:
            "Установка головного устройства 2DIN в штатное место с выводом микрофона, GPS-антенны, USB-модема, USB-входа, AUX’а",
        },
        { value: "8 000" },
      ],
      [
        {
          value: "Установка динамиков коаксиальных в штатные места",
        },
        { value: "5 000" },
      ],
      [
        {
          value: "Установка динамиков 2-х компонентных в штатные места",
        },
        { value: "7 000" },
      ],
      [
        {
          value:
            "Установка и подключение 4-х канального усилителя (включая протяжку силовых, межблочных/сигнальных кабелей, акустических кабелей, работу по замене динамиков, изготовление простого подиума под усилитель)",
        },
        { value: "25 000" },
      ],
      [
        {
          value:
            "Установка и подключение активного сабвуфера (включая, протяжку силовых, межблочных/сигнальных кабелей)",
        },
        { value: "10 000" },
      ],
      [
        {
          value: "Проставочные кольца под динамики, пара",
        },
        { value: "800" },
      ],
      [
        {
          value: "Изготовление подиумов в стойки, пара, включая материал",
        },
        { value: "20 000" },
      ],
      [
        {
          value: "Оформление багажника",
        },
        { value: "10 000" },
      ],
      [
        {
          value: "Изготовление корпуса для сабвуфера «стелс» , включая материал",
        },
        { value: "45 000" },
      ],
    ],
  },

  detailing: {
    headCols: ["Услуга", "Малый", "Средний", "Большой"],
    data: [
      [{ value: "Чистка интерьера 'стандарт'" }, { value: "8000" }, { value: "10 000" }, { value: "14 000" }],
      [{ value: "Чистка интерьера 'детейлинг'" }, { value: "12 000" }, { value: "18 000 " }, { value: "25 000" }],
      [{ value: "Одношаговая полировка" }, { value: "9 000" }, { value: "12 000" }, { value: "14 000" }],
      [{ value: "Двухшаговая полировка" }, { value: "14 000" }, { value: "18 000" }, { value: "23 000" }],
      [
        { value: "Нанесение 'жидкого стекла' (с полировкой)" },
        { value: "24 000" },
        { value: "30 000" },
        { value: "36 000" },
      ],
      [{ value: "Абразивная полировка" }, { value: "18 000" }, { value: "23 000" }, { value: "28 000" }],
      [{ value: "Нанесение керамики (с полировкой)" }, { value: "30 000" }, { value: "38 000" }, { value: "46 000" }],
      [{ value: "Нанесение керамики на плёнку" }, { value: "15 000" }, { value: "18 500" }, { value: "23 000" }],
      [{ value: "Антидождь полный (все стёкла)" }, { value: "5 000" }, { value: "6 000" }, { value: "7 000" }],
      [{ value: "Антидождь передняя полусфера" }, { value: "3 500" }, { value: "3 500" }, { value: "4 500" }],
      [{ value: "Полировка одной детали" }, { value: "1 000" }, { value: "10 000" }, { value: "14 000" }],
      [{ value: "Полировка фар, пара" }, { value: "3 000" }, { value: " " }, { value: " " }],
      [{ value: "Химическое восстановление фар, пара" }, { value: "8 000" }, { value: " " }, { value: " " }],
    ],
  },

  equipment: {
    headCols: ["Вид работы", "Стоимость"],
    data: [
      [
        {
          value:
            "Установка и скрытое подключение регистратора (на зажигание), 1 камера / 2 камеры (перед + зад), работа",
        },
        { value: "8 000 / 12 000" },
      ],
      [
        {
          value: "Установка доводчиков дверей, 4 шт., включая оборудование",
        },
        { value: "54 000" },
      ],
      [
        {
          value:
            "Установка контурной подсветки салона Ambient (многоцветная, многорежимная, с управлением по Bluetooth), включая компоненты - 10 / 18 / 22 точки",
        },
        { value: "25 000 / 35 000 / 40 000" },
      ],
      [
        {
          value: "Установка универсальной системы кругового обзора 360, включая оборудование",
        },
        { value: "70 000" },
      ],
      [
        {
          value: "Установка системы кругового обзора 360 под штатное ГУ, включая оборудование",
        },
        { value: "105 000" },
      ],
      [
        {
          value: "Установка камеры заднего вида, работа",
        },
        { value: "8 000" },
      ],
      [
        {
          value: "Установка парктроников (передних или задних), работа",
        },
        { value: "8 000" },
      ],
      [
        {
          value:
            "Установка охранной системы Scher-Khan X4 Compact (управление через приложение с телефона и метки, открытие/закрытие, автозапуск и т.д.)",
        },
        { value: "34 500" },
      ],
      [
        {
          value:
            "Установка охранной системы Scher-Khan X6 Compact (управление через приложение с телефона и метки, открытие/закрытие, автозапуск и т.д. + точно позиционирование автомобиля по GPS)",
        },
        { value: "37 700" },
      ],
      [
        {
          value: "Установка дополнительных модулей света (балки, фары-искатели т.д.), работа",
        },
        { value: "6 000" },
      ],
      [
        {
          value: "Установка дополнительных клаксонов, СГУ, стробоскопов и т.д., работа",
        },
        { value: "6 000" },
      ],
    ],
  },

  //
} as const;

async function getServicePrice(serviceName: keyof typeof serviceNames): Promise<ITableData> {
  return new Promise((resolve) => {
    setTimeout(() => {
      resolve(PRICES[`${serviceName}`]);
    }, 1500);
  });
}

export { getServicePrice };
